//======================================================= Presets Groups    ================================
Group group[] PROGMEM = {
  733,    "ВЛАДИМИР",
  737,    "ИВАНОВО",
  762,    "РЯЗАНЬ",
  769,    "ТВЕРЬ",
  771,    "ТУЛА",
  776,    "ЯРОСЛАВЛЬ",
  777,		"МОСКВА",
  778,    "САНКТ-ПЕТЕРБУРГ",
};
//======================================================= END Presets Groups     ===========================

//======================================================= Memory     =======================================
Memory memory[] PROGMEM = {

  87.5,   "БИЗНЕС",             "777",  // БИЗНЕС- FM
  87.9,   "ЛАЙК",               "777",  // Like FM
  88.3,   "РЕТРО",              "777",  // Радио Ретро FM
  88.7,   "ЮМОР",               "777",  // Юмор FM
  89.1,   "ДЖАЗ",               "777",  // Радио Джаз
  89.5,   "МЕГАПОЛИС",          "777",  // Радио Мегаполис FM
  89.9,   "СТРАНА",             "777",  // Страна FM
  90.3,   "АВТО РАДИО",         "777",  // Авто Радио
  90.8,   "РЕЛАКС",             "777",  // Relax-FM
  91.2,   "ЭХО МОСКВЫ",         "777",  // Радио Эхо Москвы
  91.6,   "КУЛЬТУРА",           "777",  // Радио Культура
  92.0,   "МОСКВА",             "777",  // Москва ФМ
  92.4,   "ДАЧА",               "777",  // Радио Дача
  92.8,   "КАРНАВАЛ",           "777",  // Радио Карнавал
  93.2,   "СТУДИЯ 21",          "777",  // STUDIO 21
  93.6,   "КОММЕРСАНТ",         "777",  // Коммерсант ФМ
  94.0,   "ВОСТОК",             "777",  // Восток FM
  94.4,   "ВЕСНА",              "777",  // Весна FM
  94.8,   "ГОВОРИТ МОСКВА",     "777",  // Говорит Москва
  95.2,   "РОК",                "777",  // Рок ФМ
  95.6,   "ЗВЕЗДА",             "777",  // Радио Звезда-FM
  96.0,   "ДОРОЖНОЕ",           "777",  // Дорожное радио
  96.4,   "ТАКСИ",              "777",  // Такси FM
  96.8,   "ДЕТСКОЕ",            "777",  // Детское радио
  97.2,   "КОМСОМОЛЬСКАЯ ПРАВДА","777",  // Радио Комсомольская правда
  97.6,   "ВЕСТИ",              "777",  // Вести ФМ
  98.0,   "ШОКОЛАД",            "777",  // Радио Шоколад
  98.4,   "НОВОЕ",              "777",  // Новое Радио
  98.8,   "РОМАНТИКА",          "777",  // Радио Романтика
  99.2,   "ОРФЕЙ",              "777",  // Радио Орфей
  99.6,   "РУССКИЙ ХИТ",        "777",  // Радио Русский Хит
  100.1,  "СЕРЕБРЯНЫЙ ДОЖДЬ",   "777",  // Радио Серебряный Дождь
  100.5,  "ЖАРА",               "777",  // Жара FM
  100.9,  "ВЕРА",               "777",  // Радио Вера
  101.2,  "DFM",                "777",  // Радио DFM
  101.7,  "НАШЕ РАДИО",         "777",  // Наше Радио
  102.1,  "МОНТЕ-КАРЛО",        "777",  // Радио Монте-Карло
  102.5,  "КАМЕДИ",             "777",  // Comedy FM
  103.0,  "ШАНСОН",             "777",  // Радио Шансон
  103.4,  "МАЯК",               "777",  // Радио Маяк
  103.7,  "МАКСИМУМ",           "777",  // Радио Максимум
  104.2,  "NRJ",                "777",  // Радио Энергия FM
  104.7,  "РАДИО 7",            "777",  // Радио 7 На Семи Холмах
  105.0,  "КНИГА",              "777",  // Радио Книга
  105.3,  "КАПИТАЛ",            "777",  // Capital FM
  105.7,  "РУССКОЕ РАДИО",      "777",  // Русское Радио
  106.2,  "ЕВРОПА ПЛЮС",        "777",  // Радио Европа Плюс
  106.6,  "LOVE",               "777",  // Love радио
  107.0,  "ЗВУК IZ.RU",         "777",  // звук IZ.RU
  107.4,  "ХИТ",                "777",  // Радио Хит FM
  107.8,  "МИЛИЦЕЙСКАЯ ВОЛНА",  "777",  // Радио Новая Милицейская Волна
  
  66.42,  "РАДИО РОССИИ",       "777",  // Радио России
  71.30,  "ПИ FM",              "777",  // Пи FM
  72.92,  "РАДОНЕЖ",            "777",  // Радио Радонеж

   1179,  "ROMANIA Actualitati","ALL",  // Румынское радио
   1413,  "РАДИО РОССИИ",       "ALL",

   7260,  "Азиатское радио",    "ALL",

  27135,  "Дальнобойщики",         "",
};
//======================================================= END Memory     ===================================
